CITIES = {
    'Одесса': ['Одесса', 'Черноморск', 'Грибовка', 'Затока', 'Измаил', 'Каролино-Бугаз', 'Коблево', 'Южный',
               'Белгород-Днестровский'],

    'Киев': ['Киев', 'Белая Церковь', 'Борисполь', 'Боярка', 'Бровары', 'Буча', 'Вишневое', 'Вышгород', 'Ирпень',
             'Украинка', 'Фастов'],

    'Харьков': ['Харьков', 'Лозовая', 'Купянск', 'Изюм'],

    'Днепр': ['Днепр', 'Кривой Рог', 'Каменское', 'Никополь', 'Павлоград', 'Новомосковск'],

    'Львов': ['Львов', 'Борислав', 'Дрогобыч', 'Самбор', 'Стрый', 'Червоноград']
}
