from dataclasses import dataclass

from core import Translations

stub = 'Бот временно не работает...'


@dataclass
class T(Translations):
    ua: str


# ===

main_menu = T('Главное меню:', ua='Головне меню:')
no_my_ads = T('У вас еще нет объявлений', ua='У вас ще немає оголошень')

_ = """
》 Чтобы создать объявление, вам необходимо пройти поэтапно несколько следующих шагов:

1) Указать основную информацию о заведении
2) Добавить от 1 до 3-х вакансий
3) Указать дополнительную информацию/услуги/контакты

В самом конце можно посмотреть, как будет выглядеть ваше объявление, и при необходимости изменить любую информацию
"""

_ua = """
》 Щоб створити оголошення, вам необхідно пройти поетапно декілька наступних кроків:

1) Вказати основну інформацію про заклад
2) Додати від 1 до 3-х вакансій
3) Вказати додаткову інформацію/послуги/контакти

У самому кінці можна подивитися, як виглядатиме ваше оголошення і при необхідності змінити будь-яку інформацію
"""

creating_ad_info = T(_, ua=_ua)

ask_regional_city = T('Выберите областной город:', ua='Виберіть обласне місто:')

ask_city = T('Выберите один из городов:', ua='Виберіть одне з міст:')

_ = """
🏨 <b>Укажите ваш тип заведения:</b>
(ресторан, бар, кафе, кофейня, отель, кальянная, гостиница, паб и другое)
"""

_ua = """
🏨 <b>Вкажіть ваш тип закладу:</b>
(ресторан, бар, кафе, кав'ярня, отель, кальянная, готель, паб і інше)
"""

ask_institution_type = T(_, ua=_ua)

_ = """
⚜️ <b>Укажите название заведения</b>
(пример: Alaska, Jord, Catch, Azuma, Fratelli, Goodman, Coast и так далее)
"""

_ua = """
⚜️ <b>Вкажіть назву закладу</b>
(наприклад: Alaska, Jord, Catch, Azuma, Fratelli, Goodman, Coast і так далі)
"""

ask_institution_name = T(_, ua=_ua)

_ = """
📍 <b>Укажите адрес заведения</b>
(пример: улица, переулок, площадь, бульвар, проспект и так далее)
"""

_ua = """
📍 <b>Вкажіть адресу закладу</b>
(наприклад: вулиця, провулок, площа, бульвар, проспект і так далі)
"""

ask_institution_address = T(_, ua=_ua)

_ = """
👤 <b>Укажите название вакансии:</b>
(повар, официант, бармен, бариста, посудомойщица, уборщица и т.д.)
"""

_ua = """
👤 <b>Вкажіть назву вакансії:</b>
(кухар, офіціант, бармен, бариста, посудомийниця, прибиральниця і т.д.)
"""

ask_vacancy_title = T(_, ua=_ua)

_ = """
📈 <b>Требуемый опыт работы</b>
(например: от 1-го года, от 2-х лет, от 5-ти лет, не обязателен и т.д.)
"""

_ua = """
📈 <b>Необхідний досвід роботи</b>
(наприклад: від 1-го року, від 2-х років, від 5-ти років, не обов'язковий і т.д.)
"""

ask_work_experience = T(_, ua=_ua)

_ = """
💵 <b>Укажите зарплату (в цифрах)</b>
(ставка, процент, смена, в месяц, +бонусы, + премиальные и т.д.)
"""

_ua = """
💵 <b>Вкажіть зарплату (у цифрах)</b>
(ставка, відсоток, зміна, на місяць, +бонуси, +преміальні і т.д.)
"""

ask_salary = T(_, ua=_ua)

_ = """
📆 <b>Укажите график работы</b>
(пример: 3/3, 5/2, суточный ½)
"""

_ua = """
📆 <b>Вкажіть графік роботи</b>
(наприклад: 3/3, 5/2, добовий ½)
"""

ask_schedule = T(_, ua=_ua)

_ = """
⏰ <b>Укажите время работы</b>
(пример: с 08.30 до 22.00)
"""

_ua = """
⏰ <b>Вкажіть час роботи</b>
(наприклад: з 08.30 до 22.00)
"""

ask_working_hours = T(_, ua=_ua)

_ = """
📝 <b>Дополнительная информация</b>
(желаемый пол, возраст, питание, оплата такси, оформление и т.д.)
"""

_ua = """
📝 <b>Додаткова інформація</b>
(бажана стать, вік, харчування, оплата таксі, оформлення і т.д.)
"""

ask_additional_info = T(_, ua=_ua)
